//
//  Vacancy + Data.swift
//  IosSolid
//
//  Created by Grigory Sapogov on 23.12.2023.
//

import Foundation

extension Vacancy {
    
    static var array: [[String: Any]] {
        
        [
            [
                "userId": 1,
                "id": 1,
                "title": "iOS Developer",
                "solary": "4000 $",
                "body": "Создание приложений для мобильных платформ под управлением iOS. Анализ новых технологий на предмет их внедрения. Опыт от 3х лет"
            ],
            [
                "userId": 1,
                "id": 2,
                "title": "Android Developer",
                "solary": "3800 $",
                "body": "Создание приложений для мобильных платформ под управлением Android. Анализ новых технологий на предмет их внедрения. Опыт от 3х лет."
            ],
            [
                "userId": 1,
                "id": 3,
                "title": "Junior IOS Developer",
                "solary": "1000 $",
                "body": "Создание приложений для мобильных платформ под управлением iOS. Поддерживать текущее приложение, оптимизировать его производительность, дорабатывать и улучшать. Опыт разработки под iOS от 1 года (не обязательно коммерческий)."
            ],
            [
                "userId": 1,
                "id": 4,
                "title": "Backend Developer",
                "solary": "3000 $",
                "body": "Участвовать в проектировании системы, разрабатывать базовую логику и алгоритмы работы приложения. Необходимые интеграции с внешними сервисами"
            ],
            [
                "userId": 1,
                "id": 5,
                "title": "Java Developer",
                "solary": "3500 $",
                "body": "Понимание принципов ООП, понимание алгоритмов и структур данных, знание Java Core. опыт написания unit-тестов, знания систем контроля версий (git или svn), Spring Framework, а также ORM (Hibernate Framework)."
            ],
            [
                "userId": 1,
                "id": 6,
                "title": "Frontend Developer",
                "solary": "2000 $",
                "body": "Разрабатывать интеграционные сервисы, внутренние сервисы. Много писать на React"
            ],
            [
                "userId": 1,
                "id": 7,
                "title": "C++ Developer",
                "solary": "6000 $",
                "body": "Знание С/С++, JAVA. "
            ],
            [
                "userId": 1,
                "id": 8,
                "title": "C# Developer",
                "solary": "4000 $",
                "body": "Знание стека .Net (одной или нескольких технологий: WPF, WinForms, ASP .Net/Core). Навыки работы с реляционными СУБД, SQL."
            ],
            [
                "userId": 1,
                "id": 9,
                "title": "Unity Developer",
                "solary": "4000 $",
                "body": "Разработка VR программных модулей на Unity/C# на основе готовых 3d моделей"
            ],
            [
                "userId": 1,
                "id": 10,
                "title": "Unreal Developer",
                "solary": "4100 $",
                "body": "Отличное знание и владение Unreal Engine 4-5. Разработка ИИ механик, систем и их взаимодействие. Разработка проекта в связке с разработчиком AI."
            ],
            [
                "userId": 2,
                "id": 11,
                "title": "Flutter Developer",
                "solary": "3600 $",
                "body": "Разработка ERP системы для корпораций. Платформы: веб, десктоп и мобилки. Участие в создании архитектуры приложения. "
            ],
            [
                "userId": 2,
                "id": 12,
                "title": "PHP Developer",
                "solary": "2500 $",
                "body": "Разработка новых функций портала и доработка текущих. Программирование на стеке PHP+Mysql+Html по технологии MVC с использованием Git."
            ],
            [
                "userId": 2,
                "id": 13,
                "title": "Python Developer",
                "solary": "4000 $",
                "body": "Разрабатывать новые сервисы для платформы. Поддерживать существующие."
            ],
            [
                "userId": 2,
                "id": 14,
                "title": "Senior Android Developer",
                "solary": "4500 $",
                "body": "Создание приложений для мобильных платформ под управлением iOS. Анализ новых технологий на предмет их внедрения."
            ],
            [
                "userId": 2,
                "id": 15,
                "title": "Senior C# Developer",
                "solary": "45000 $",
                "body": "Заниматься разработкой web приложения на C# .net 6, реализовывать, как маленькие, так и большие проектные фичи, участвовать в проектировании архитектуры"
            ]
        
        ]
        
    }
    
}
